# LMWP-YOLO - YOLOv11n with MAFR
# Nano version with lightweight backbone and MAFR neck

# Parameters
nc: 80  # number of classes
scales:  # Model compound scaling constants (not used, but required)
  n: [0.33, 0.25, 2.0]
  s: [0.33, 0.50, 2.0]
  m: [0.67, 0.75, 1.5]
  l: [1.00, 1.00, 1.0]
  x: [1.00, 1.25, 1.0]

# YOLOv11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [16, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [32, 3, 2]]  # 1-P2/4
  - [-1, 1, C2f, [32, True]]
  - [-1, 1, Conv, [64, 3, 2]]  # 3-P3/8
  - [-1, 2, C2f, [64, True]]
  - [-1, 1, Conv, [128, 3, 2]]  # 5-P4/16
  - [-1, 2, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 7-P5/32
  - [-1, 1, C2f, [256, True]]
  - [-1, 1, SPPF, [256, 5]]  # 9
  - [-1, 1, C2PSA, [256]] # 10

# YOLOv11n head with MAFR
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 1, C3k2, [128, False, 0.25]]  # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 1, C3k2, [64, False, 0.25]]  # 16 (P3/8-small)
  
  - [-1, 1, Conv, [64, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]  # cat head P4
  - [-1, 1, C3k2, [128, False, 0.25]]  # 19 (P4/16-medium)

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]  # cat head P5
  - [-1, 1, C3k2, [256, False, 0.25]]  # 22 (P5/32-large)
  
  # Add MAFR to P3
  - [16, 1, MAFR, [64]]  # 23 - MAFR enhancement on P3

  - [[23, 19, 22], 1, Detect, [nc]]  # Detect(P3-MAFR, P4, P5)