# LMWP-YOLO - Working Version (No Scale Factors)
# YOLOv11 with lightweight backbone and MAFR neck

# Parameters
nc: 80  # number of classes
scales:  # Model compound scaling constants
  n: [0.33, 0.25, 2.0]
  s: [0.33, 0.50, 2.0]
  m: [0.67, 0.75, 1.5]
  l: [1.00, 1.00, 1.0]
  x: [1.00, 1.25, 1.0]

# Lightweight backbone (LCNet-inspired)
backbone:
  # [from, repeats, module, args]
  # Stage 1
  - [-1, 1, Conv, [32, 3, 2]]      # 0-P1/2
  
  # Stage 2  
  - [-1, 1, Conv, [48, 3, 2]]      # 1-P2/4
  - [-1, 2, C2f, [48]]             # 2
  
  # Stage 3 (P3 output)
  - [-1, 1, Conv, [96, 3, 2]]      # 3-P3/8
  - [-1, 3, C2f, [96]]             # 4
  
  # Stage 4 (P4 output)
  - [-1, 1, Conv, [192, 3, 2]]     # 5-P4/16
  - [-1, 3, C2f, [192]]            # 6
  
  # Stage 5 (P5 output)
  - [-1, 1, Conv, [1024, 3, 2]]    # 7-P5/32
  - [-1, 3, C2f, [1024]]           # 8
  - [-1, 1, SPPF, [1024, 5]]       # 9
  - [-1, 1, C2PSA, [1024]]         # 10

# Head with MAFR
head:
  # P5->P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11
  - [[-1, 6], 1, Concat, [1]]                   # 12 - cat(P4, P5')
  - [-1, 3, C3k2, [512]]                        # 13 - P4'
  
  # P4->P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 4], 1, Concat, [1]]                   # 15 - cat(P3, P4')
  - [-1, 3, C3k2, [256]]                        # 16 - P3'
  
  # P3->P2
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 17
  - [-1, 3, C3k2, [128]]                        # 18 - P2
  - [-1, 1, MAFR, [128]]                        # 19 - P2 with MAFR
  
  # Detection head
  - [[19, 16, 13], 1, Detect, [nc]]            # 20 - Detect(P2, P3', P4')