# Ultralytics YOLO 🚀, AGPL-3.0 license
# LMWP-YOLO with LCNet backbone and MAFR neck - FIXED
# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]
awloss: true

# LCNet-0.75 backbone
backbone:
  - [-1, 1, lcnet_075, [1024]]                    # 0  outputs [P5=1024, P4=96, P3=48]
  - [0, 1, Index, [0]]                           # 1  P5 (stride 32, 1024 ch)
  - [0, 1, Index, [1]]                           # 2  P4 (stride 16, 96 ch)
  - [0, 1, Index, [2]]                           # 3  P3 (stride 8, 48 ch)
  - [1, 1, SPPF, [1024, 5]]                      # 4  P5' (1024 ch)
  - [4, 2, C2PSA, [1024]]                        # 5  refined P5' (1024 ch)

head:
  - [5, 1, nn.Upsample, [None, 2, "nearest"]]    # 6  ↑2 → stride 16
  - [[6, 2], 1, Concat, [1]]                     # 7  cat(P5', P4) = 1024 + 96 = 1120 ch
  - [7, 2, C3k2, [512, False]]                   # 8  P4' (1120 -> 512 ch)

  - [8, 1, nn.Upsample, [None, 2, "nearest"]]    # 9  ↑2 → stride 8
  - [[9, 3], 1, Concat, [1]]                     # 10 cat(P4', P3) = 512 + 48 = 560 ch
  - [10, 2, C3k2, [256, False]]                  # 11 P3' (560 -> 256 ch)

  - [11, 1, nn.Upsample, [None, 2, "nearest"]]   # 12 ↑2 → stride 4 (P2 path)
  - [12, 2, C3k2, [128, False]]                  # 13 P2 (256 -> 128 ch)
  - [13, 1, MAFR, [128]]                         # 14 enhanced P2 (128 ch)

  - [[14, 11, 8], 1, Detect, [nc]]               # 15 Detect(P2, P3', P4')
