# LMWP-YOLO - Option B: Simplified Working Version
# Simplified architecture that should work without errors

# Parameters
nc: 80  # number of classes

# Simplified backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4
  - [-1, 3, C2f, [128, True]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8
  - [-1, 6, C2f, [256, True]]      # 4
  - [-1, 1, Conv, [512, 3, 2]]     # 5-P4/16
  - [-1, 6, C2f, [512, True]]      # 6
  - [-1, 1, Conv, [1024, 3, 2]]    # 7-P5/32
  - [-1, 3, C2f, [1024, True]]     # 8
  - [-1, 1, SPPF, [1024, 5]]       # 9

# Simplified head with MAFR
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 10
  - [[-1, 6], 1, Concat, [1]]                   # 11 - cat P4
  - [-1, 3, C2f, [512]]                         # 12
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 13
  - [[-1, 4], 1, Concat, [1]]                   # 14 - cat P3
  - [-1, 3, C2f, [256]]                         # 15 - P3/8
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 16
  - [-1, 3, C2f, [128]]                         # 17 - P2/4
  - [-1, 1, MAFR, [128]]                        # 18 - MAFR enhancement
  
  - [[18, 15, 12], 1, Detect, [nc]]            # 19 - Detect(P2, P3, P4)
