# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect
# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs
awloss: true
# YOLOv8.0n backbone
backbone:
  - [-1, 1, lcnet_075, [1024]]                    # 0  (P5, P4, P3)
  - [0, 1, Index, [256, 0]]                     # 1  P5 (stride 32, 256 ch)
  - [0, 1, Index, [96, 1]]                      # 2  P4 (stride 16, 96 ch)
  - [0, 1, Index, [48, 2]]                      # 3  P3 (stride 8, 48 ch)
  - [1, 1, SPPF, [1024, 5]]                      # 4  P5′
  - [4, 2, C2PSA, [1024]]                        # 5  refined P5′

head:
  - [5, 1, nn.Upsample, [None, 2, "nearest"]]    # 6  ↑2 → stride 16
  - [[6, 2], 1, Concat, [1]]                     # 7  cat(P5′, P4)
  - [7, 2, C3k2, [512, False]]                   # 8  P4′

  - [8, 1, nn.Upsample, [None, 2, "nearest"]]    # 9  ↑2 → stride 8
  - [[9, 3], 1, Concat, [1]]                     # 10 cat(P4′, P3)
  - [10, 2, C3k2, [256, False]]                  # 11 P3′

  - [11, 1, nn.Upsample, [None, 2, "nearest"]]   # 12 ↑2 → stride 4 (P2 path)
  - [12, 2, C3k2, [128, False]]                  # 13 P2 (no concat)
  - [13, 1, MAFR, [128]]                         # 14 enhanced P2

  - [[14, 11, 8], 1, Detect, [nc]]               # 15 Detect(P2, P3′, P4′)
