# Ultralytics YOLOv11 🚀, GPL-3.0 license
# LMWP-YOLO: Lightweight Mamba-assisted FPN with Receptive-field Attention Neck
# Final working version using custom selector modules

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  l: [1.00, 1.00, 512]

# Architecture
backbone:
  # [from, repeats, module, args]
  - [-1, 1, lcnet_075, [1024]]       # 0  outputs (P5, P4, P3) = (1024, 96, 48)
  - [0, 1, Select0, []]              # 1  P5 (1024 channels)
  - [0, 1, Select1, []]              # 2  P4 (96 channels)  
  - [0, 1, Select2, []]              # 3  P3 (48 channels)
  - [1, 1, SPPF, [512, 5]]           # 4  P5' (1024 -> 512 channels)
  - [4, 1, C2PSA, [512]]             # 5  refined P5' (512 channels)

head:
  - [5, 1, nn.Upsample, [None, 2, "nearest"]]    # 6  upsample P5' (512 channels)
  - [[6, 2], 1, Concat, [1]]                     # 7  cat(P5', P4) = 512 + 96 = 608 channels
  - [7, 1, C3k2, [256, False]]                   # 8  P4' (608 -> 256 channels)
  
  - [8, 1, nn.Upsample, [None, 2, "nearest"]]    # 9  upsample P4' (256 channels)
  - [[9, 3], 1, Concat, [1]]                     # 10 cat(P4', P3) = 256 + 48 = 304 channels
  - [10, 1, C3k2, [128, False]]                  # 11 P3' (304 -> 128 channels)
  
  - [11, 1, nn.Upsample, [None, 2, "nearest"]]   # 12 upsample P3' (128 channels)
  - [12, 1, C3k2, [64, False]]                   # 13 P2 (128 -> 64 channels)
  - [13, 1, MAFR, [64]]                          # 14 enhanced P2 (64 channels)
  
  - [[14, 11, 8], 1, Detect, [nc]]              # 15 Detect(P2, P3', P4')
