# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv11 with LCNet backbone and MAFR neck - Using scale 'l' (width=1.0)

# Parameters
nc: 80  # number of classes
scale: l  # Explicitly use 'l' scale which has width_multiple=1.0
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]  # depth=1.0, width=1.0 (no width scaling!)
  x: [1.00, 1.25, 512]
awloss: true

# YOLOv11 backbone
backbone:
  - [-1, 1, lcnet_075, [1024]]                    # 0: outputs [P5, P4, P3]
  - [0, 1, Index, [0]]                            # 1: P5 (1024 ch)
  - [0, 1, Index, [1]]                            # 2: P4 (96 ch)
  - [0, 1, Index, [2]]                            # 3: P3 (48 ch)
  - [1, 1, SPPF, [1024, 5]]                       # 4: P5' (1024 ch)
  - [4, 1, C2PSA, [1024]]                         # 5: refined P5' (1024 ch)

# YOLOv11 head
head:
  - [5, 1, nn.Upsample, [None, 2, "nearest"]]     # 6: upsample P5' (1024 ch)
  - [[6, 2], 1, Concat, [1]]                      # 7: cat(P5', P4) = 1024 + 96 = 1120 ch
  - [7, 1, C3k2, [512, False]]                    # 8: P4' (512 ch)
  
  - [8, 1, nn.Upsample, [None, 2, "nearest"]]     # 9: upsample P4' (512 ch)
  - [[9, 3], 1, Concat, [1]]                      # 10: cat(P4', P3) = 512 + 48 = 560 ch
  - [10, 1, C3k2, [256, False]]                   # 11: P3' (256 ch)
  
  - [11, 1, nn.Upsample, [None, 2, "nearest"]]    # 12: upsample P3' (256 ch)
  - [12, 1, C3k2, [128, False]]                   # 13: P2 (128 ch)
  - [13, 1, MAFR, [128]]                          # 14: enhanced P2 (128 ch)
  
  - [[14, 11, 8], 1, Detect, [nc]]                # 15: Detect(P2, P3', P4')