# Ultralytics YOLO 🚀, AGPL-3.0 license
# Parameters
nc: 80  # number of classes
scales: 
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] 
  s: [0.33, 0.50, 1024]  
  m: [0.67, 0.75, 768]  
  l: [1.00, 1.00, 512]  
  x: [1.00, 1.25, 512]   
# YOLOv8.0n backbone
backbone:
  - [-1, 1, lcnet_075, [True]]                           # 4-p5/32
  - [-1, 1, SPPF, [1024, 5]]          # 5
  - [-1, 2, C2PSA, [1024]]     # 6

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 13 9

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 16 (P3/8-small) 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 1], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [128, False]] # 19 (P2/4-xsmall) 15

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [256, False]] # 22 (P3/8-small) 18
  - [-1, 1, MAFR, [256]]  # 23 (P5/32-large) 19
  - [[15, 19], 1, Detect, [nc]] # Detect(P3, P4, P5)
