# Ultralytics YOLO 🚀, AGPL-3.0 license
# LWMP-YOLO Simple test

# Parameters
nc: 80  # number of classes

# Simple backbone test
backbone:
  - [-1, 1, Conv, [32, 3, 2]]      # 0-P1/2
  - [-1, 1, Conv, [64, 3, 2]]      # 1-P2/4  
  - [-1, 1, Conv, [128, 3, 2]]     # 2-P3/8
  - [-1, 1, Conv, [256, 3, 2]]     # 3-P4/16
  - [-1, 1, Conv, [384, 3, 2]]     # 4-P5/32
  - [-1, 1, SPPF, [384, 5]]        # 5

# Simple head
head:
  - [-1, 1, Conv, [192, 1, 1]]                    # 6
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 7
  - [[-1, 3], 1, Concat, [1]]                     # 8
  - [-1, 1, C2f, [256]]                           # 9
  
  - [-1, 1, Conv, [128, 1, 1]]                    # 10
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 11
  - [[-1, 2], 1, Concat, [1]]                     # 12
  - [-1, 1, C2f, [128]]                           # 13
  
  - [-1, 1, MAFR, [128]]                          # 14
  - [9, 1, MAFR, [256]]                           # 15
  
  - [[14, 15], 1, Detect, [nc]]                   # 16