# Ultralytics YOLO 🚀, AGPL-3.0 license
# Simplified YOLO11n-LWMP model with MAFR modules

# Parameters
nc: 80  # number of classes

# YOLO11n backbone (simplified)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4  
  - [-1, 3, C2f, [128, True]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 3, C2f, [256, True]]  # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 3, C2f, [512, True]]  # 6
  - [-1, 1, Conv, [512, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [512, True]]  # 8
  - [-1, 1, SPPF, [512, 5]]    # 9

# YOLO11n head with MAFR
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [256, False]]  # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [128, False]]  # 15 (P3/8-small)

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [256, False]]  # 18 (P4/16-medium)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [512, False]]  # 21 (P5/32-large)
  
  # Add MAFR module before detection head
  - [15, 1, MAFR, [128]]   # 22 for P3
  - [18, 1, MAFR, [256]]   # 23 for P4
  - [21, 1, MAFR, [512]]   # 24 for P5

  - [[22, 23, 24], 1, Detect, [nc]]  # Detect(P3, P4, P5)