# Ultralytics YOLO 🚀, AGPL-3.0 license
# LWMP-YOLO: Exact implementation from paper
# Target: 1.23M parameters, 2.71MB model size, 95.7% mAP@0.5

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 512]  # Reduced max channels for lightweight model

# LWMP-YOLO backbone (PP-LCNet x0.75)
backbone:
  # PP-LCNet x0.75 outputs at P3/8, P4/16, P5/32 with channels [192, 384, 384]
  - [-1, 1, LWMP_PPLCNet, [3, True]]  # 0 - outputs list of [P3, P4, P5]

# LWMP-YOLO head  
head:
  # Extract individual feature maps from backbone output
  - [0, 1, Index, [0]]       # 1 - P3/8 (192 channels)
  - [0, 1, Index, [1]]       # 2 - P4/16 (384 channels)  
  - [0, 1, Index, [2]]       # 3 - P5/32 (384 channels)
  
  # Add SPPF to P5
  - [3, 1, SPPF, [384, 5]]   # 4 - SPPF(c1=384, c2=384, k=5)
  
  # FPN - Top-down pathway
  - [4, 1, Conv, [192, 1, 1]]                    # 5 - lateral
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 6
  - [[6, 2], 1, Concat, [1]]                     # 7 - cat with P4 (192+384=576)
  - [-1, 1, C2f, [192, False]]                   # 8 - P4
  
  - [8, 1, Conv, [96, 1, 1]]                     # 9 - lateral
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 10
  - [[10, 1], 1, Concat, [1]]                    # 11 - cat with P3 (96+192=288)
  - [-1, 1, C2f, [96, False]]                    # 12 - P3
  
  # Add P2 layer for small objects  
  - [12, 1, Conv, [48, 1, 1]]                    # 13 - lateral
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 14
  - [-1, 1, C2f, [48, False]]                    # 15 - P2/4
  
  # PAN - Bottom-up pathway
  - [15, 1, Conv, [48, 3, 2]]                    # 16
  - [[16, 12], 1, Concat, [1]]                   # 17
  - [-1, 1, C2f, [96, False]]                    # 18 - P3
  
  - [18, 1, Conv, [96, 3, 2]]                    # 19
  - [[19, 8], 1, Concat, [1]]                    # 20
  - [-1, 1, C2f, [192, False]]                   # 21 - P4
  
  # Apply MAFR to detection features
  - [15, 1, MAFR, [48]]                          # 22 - P2 refined
  - [18, 1, MAFR, [96]]                          # 23 - P3 refined
  
  # Detection head (P2 + P3 only for small objects)
  - [[22, 23], 1, Detect, [nc]]                  # 24 - Detect(P2, P3)