# Ultralytics YOLO 🚀, AGPL-3.0 license
# LWMP-YOLO with PP-LCNet x0.75 backbone
# Implementing exact paper architecture

# Parameters
nc: 80  # number of classes
scales:
  n: [0.33, 0.25, 1024]

# Backbone - PP-LCNet x0.75 structure (exact scaled channels)
backbone:
  # Stage 0
  - [-1, 1, Conv, [12, 3, 2]]         # 0-P1/2 (16*0.75)
  
  # Stage 1 - outputs P2
  - [-1, 1, DWConv, [12, 3, 1]]       # 1
  - [-1, 1, Conv, [18, 1, 1]]         # 2 (24*0.75)
  - [-1, 1, DWConv, [18, 3, 2]]       # 3-P2/4
  - [-1, 1, Conv, [36, 1, 1]]         # 4 (48*0.75)
  - [-1, 1, DWConv, [36, 3, 1]]       # 5
  - [-1, 1, Conv, [36, 1, 1]]         # 6
  
  # Stage 2 - outputs P3  
  - [-1, 1, DWConv, [36, 3, 2]]       # 7-P3/8 (48*0.75)
  - [-1, 1, Conv, [72, 1, 1]]         # 8 (96*0.75)
  - [-1, 1, DWConv, [72, 3, 1]]       # 9
  - [-1, 1, Conv, [72, 1, 1]]         # 10
  
  # Stage 3 - outputs P4
  - [-1, 1, DWConv, [72, 5, 2]]       # 11-P4/16  
  - [-1, 1, Conv, [144, 1, 1]]        # 12 (192*0.75)
  - [-1, 1, SELayer, [144]]           # 13
  - [-1, 1, DWConv, [144, 5, 1]]      # 14
  - [-1, 1, Conv, [144, 1, 1]]        # 15
  - [-1, 1, SELayer, [144]]           # 16
  
  # Stage 4 - outputs P5
  - [-1, 1, DWConv, [144, 5, 2]]      # 17-P5/32
  - [-1, 1, Conv, [288, 1, 1]]        # 18 (384*0.75)
  - [-1, 1, SELayer, [288]]           # 19
  
  # Final layers as per author's YAML
  - [-1, 1, Conv, [1024, 1, 1]]       # 20 - project to 1024
  - [-1, 1, SPPF, [1024, 5]]          # 21
  - [-1, 2, C2PSA, [1024]]            # 22

# Head - Based on author's structure with corrected indices
head:
  # FPN - P4 path
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 23
  - [[-1, 16], 1, Concat, [1]]                  # 24 - concat with P4
  - [-1, 2, C3k2, [512, False]]                 # 25
  
  # FPN - P3 path
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 26
  - [[-1, 10], 1, Concat, [1]]                  # 27 - concat with P3
  - [-1, 2, C3k2, [256, False]]                 # 28
  
  # FPN - P2 path  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 29
  - [[-1, 6], 1, Concat, [1]]                   # 30 - concat with P2
  - [-1, 2, C3k2, [128, False]]                 # 31
  
  # PAN - Bottom up
  - [-1, 1, Conv, [256, 3, 2]]                  # 32
  - [[-1, 28], 1, Concat, [1]]                  # 33
  - [-1, 2, C3k2, [256, False]]                 # 34
  - [-1, 1, MAFR, [256]]                        # 35 - MAFR on P3
  
  # Detect P2 and P3
  - [[31, 35], 1, Detect, [nc]]                 # 36