# LWMP-YOLO Simplified Configuration
# This version works with the current implementation without complex patching

# Parameters
nc: 80  # number of classes
scales:
  n: [0.33, 0.25, 1024]  # depth, width, max_channels

# Backbone
backbone:
  # PP-LCNet x0.75 (manual expansion for now)
  - [-1, 1, Conv, [12, 3, 2]]  # 0 - P1/2
  - [-1, 1, DWConv, [24, 3, 1]]  # 1
  - [-1, 1, DWConv, [32, 3, 2]]  # 2 - P2/4  
  - [-1, 1, DWConv, [48, 3, 1]]  # 3
  - [-1, 1, DWConv, [72, 3, 2]]  # 4 - P3/8
  - [-1, 1, DWConv, [144, 5, 2]]  # 5 - P4/16
  - [-1, 1, DWConv, [144, 5, 1]]  # 6
  - [-1, 1, DWConv, [144, 5, 1]]  # 7
  - [-1, 1, DWConv, [144, 5, 1]]  # 8
  - [-1, 1, DWConv, [144, 5, 1]]  # 9
  - [-1, 1, DWConv, [144, 5, 1]]  # 10
  - [-1, 1, DWConv, [288, 5, 2]]  # 11 - P5/32
  - [-1, 1, DWConv, [288, 5, 1]]  # 12
  
  # Standard YOLO processing
  - [-1, 1, SPPF, [512, 5]]  # 13

# Head
head:
  # P5->P4
  - [-1, 1, Conv, [256, 1, 1]]  # 14
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 15
  - [[-1, 10], 1, Concat, [1]]  # 16 - concat with P4
  - [-1, 3, C3k2, [256, False]]  # 17
  
  # P4->P3  
  - [-1, 1, Conv, [128, 1, 1]]  # 18
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 19
  - [[-1, 4], 1, Concat, [1]]  # 20 - concat with P3
  - [-1, 3, C3k2, [128, False]]  # 21
  
  # P3->P2
  - [-1, 1, Conv, [64, 1, 1]]  # 22
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 23
  - [[-1, 2], 1, Concat, [1]]  # 24 - concat with P2
  - [-1, 3, C3k2, [64, False]]  # 25 - P2 out
  
  # P2->P3
  - [-1, 1, Conv, [64, 3, 2]]  # 26
  - [[-1, 21], 1, Concat, [1]]  # 27
  - [-1, 3, C3k2, [128, False]]  # 28 - P3 out
  
  # P3->P4
  - [-1, 1, Conv, [128, 3, 2]]  # 29
  - [[-1, 17], 1, Concat, [1]]  # 30
  - [-1, 3, C3k2, [256, False]]  # 31
  - [-1, 1, MAFR, [256]]  # 32 - P4 out with MAFR
  
  # Detection head
  - [[25, 28, 32], 1, Detect, [nc]]  # 33 - Detect(P2, P3, P4)