# Ultralytics YOLO 🚀, AGPL-3.0 license
# LWMP-YOLO: Correct implementation matching paper specifications
# Target: 2.71 MB model size, 1.23M parameters

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.125, 256]  # Much smaller width multiplier to match paper

# LWMP-YOLO backbone with PP-LCNet
backbone:
  # PP-LCNet x0.75 backbone
  # Using depthwise separable convolutions throughout
  - [-1, 1, Conv, [12, 3, 2]]  # 0-P1/2, 12=make_divisible(16*0.75)
  
  # DepSep blocks following PP-LCNet architecture
  - [-1, 1, DWConv, [24, 3, 1]]  # 1, 24=make_divisible(32*0.75)
  - [-1, 1, DWConv, [48, 3, 2]]  # 2-P2/4, 48=make_divisible(64*0.75)
  - [-1, 1, DWConv, [48, 3, 1]]  # 3
  - [-1, 1, DWConv, [96, 3, 2]]  # 4-P3/8, 96=make_divisible(128*0.75)
  - [-1, 1, DWConv, [96, 3, 1]]  # 5
  - [-1, 1, DWConv, [192, 5, 2]] # 6-P4/16, 192=make_divisible(256*0.75)
  - [-1, 1, DWConv, [192, 5, 1]] # 7
  - [-1, 1, DWConv, [192, 5, 1]] # 8
  - [-1, 1, DWConv, [192, 5, 1]] # 9
  - [-1, 1, DWConv, [192, 5, 1]] # 10
  - [-1, 1, DWConv, [192, 5, 1]] # 11
  - [-1, 1, DWConv, [384, 5, 2]] # 12-P5/32, 384=make_divisible(512*0.75)
  - [-1, 1, SELayer, [384, 16]]  # 13 - SE module
  - [-1, 1, DWConv, [384, 5, 1]] # 14
  - [-1, 1, SELayer, [384, 16]]  # 15 - SE module
  - [-1, 1, SPPF, [384, 5]]      # 16

# LWMP-YOLO head with MAFR
head:
  # Significantly reduced channels to match paper's parameter count
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 17
  - [[-1, 11], 1, Concat, [1]]  # 18 - cat with P4
  - [-1, 1, C3k2, [96, False]]  # 19 - reduced from 192
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 20
  - [[-1, 5], 1, Concat, [1]]   # 21 - cat with P3
  - [-1, 1, C3k2, [48, False]]  # 22 (P3/8-small) - reduced from 96
  
  - [-1, 1, Conv, [48, 3, 2]]   # 23
  - [[-1, 19], 1, Concat, [1]]  # 24
  - [-1, 1, C3k2, [96, False]]  # 25 (P4/16-medium) - reduced from 192
  
  - [-1, 1, Conv, [96, 3, 2]]   # 26
  - [[-1, 16], 1, Concat, [1]]  # 27
  - [-1, 1, C3k2, [192, False]] # 28 (P5/32-large) - reduced from 384
  
  # MAFR modules with reduced channels
  - [22, 1, MAFR, [48]]   # 29 for P3
  - [25, 1, MAFR, [96]]   # 30 for P4
  - [28, 1, MAFR, [192]]  # 31 for P5
  
  - [[29, 30, 31], 1, Detect, [nc]]  # Detect(P3, P4, P5)