# LWMP-YOLO Working Configuration
# This configuration properly integrates all LWMP components

# Parameters
nc: 80  # number of classes
scales:
  n: [0.33, 0.25, 1024]  # depth, width, max_channels

# Backbone
backbone:
  # PP-LCNet x0.75 backbone (outputs 384 channels at P5)
  - [-1, 1, lcnet_lwmp, [3]]        # 0 - outputs P5 (384ch), stores P2,P3,P4
  - [-1, 1, SPPF, [1024, 5]]        # 1 - Spatial Pyramid Pooling
  - [-1, 2, C2PSA, [1024]]          # 2 - Cross Stage Partial with Attention

# Head  
head:
  # FPN - Top-down pathway
  # P5 -> P4
  - [-1, 1, Conv, [512, 1, 1]]                          # 3
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]         # 4
  - [4, 1, Conv, [256, 1, 1]]                           # 5 - lateral from P4
  - [[4, 5], 1, Concat, [1]]                            # 6 - merge
  - [-1, 3, C3k2, [512, False]]                         # 7 - P4 refined
  
  # P4 -> P3
  - [-1, 1, Conv, [256, 1, 1]]                          # 8
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]         # 9
  - [9, 1, Conv, [128, 1, 1]]                           # 10 - lateral from P3
  - [[9, 10], 1, Concat, [1]]                           # 11 - merge
  - [-1, 3, C3k2, [256, False]]                         # 12 - P3 refined
  
  # P3 -> P2
  - [-1, 1, Conv, [128, 1, 1]]                          # 13
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]         # 14
  - [14, 1, Conv, [64, 1, 1]]                           # 15 - lateral from P2
  - [[14, 15], 1, Concat, [1]]                          # 16 - merge
  - [-1, 3, C3k2, [128, False]]                         # 17 - P2 refined
  
  # PAN - Bottom-up pathway
  # P2 -> P3
  - [-1, 1, Conv, [128, 3, 2]]                          # 18
  - [[-1, 12], 1, Concat, [1]]                          # 19 - merge with FPN P3
  - [-1, 3, C3k2, [256, False]]                         # 20 - P3 out
  
  # P3 -> P4  
  - [-1, 1, Conv, [256, 3, 2]]                          # 21
  - [[-1, 7], 1, Concat, [1]]                           # 22 - merge with FPN P4
  - [-1, 3, C3k2, [512, False]]                         # 23
  - [-1, 1, MAFR, [512]]                                # 24 - P4 out with MAFR
  
  # Detection head - P2, P3, P4
  - [[17, 20, 24], 1, Detect, [nc]]                    # 25 - multi-scale detection