# Ultralytics YOLO11-LWMP for small drone detection
# Lightweight Multi-scale Wasserstein Pruned YOLO based on PP-LCNet backbone

# Parameters
nc: 80  # number of classes
scales: 
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# LWMP-YOLO backbone with PP-LCNet
backbone:
  # PP-LCNet returns features at multiple scales
  # Index 0: P2/4, Index 1: P3/8, Index 2: P4/16, Index 3: P5/32
  - [-1, 1, lcnet_075, [True]]  # 0 - PP-LCNet backbone (outputs list)
  - [-1, 1, SPPF, [1024, 5]]     # 1 - Applied to P5
  - [-1, 2, C2PSA, [1024]]       # 2 - Applied to P5

# LWMP-YOLO head with MAFR, C3TR and P2 layer for small objects
head:
  # Upsample P5 to P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]]  # 4 - cat with P4 from backbone
  - [-1, 2, C3k2, [512, False]]  # 5
  
  # Upsample to P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]  # 7 - cat with P3 from backbone
  - [-1, 2, C3k2, [256, False]]  # 8 (P3/8-small)
  
  # Upsample to P2 (for small objects)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 1], 1, Concat, [1]]  # 10 - cat with P2 from backbone
  - [-1, 2, C3k2, [128, False]]  # 11 (P2/4-xsmall)
  
  # Downsample back to P3
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]  # 13 - cat with head P3
  - [-1, 2, C3k2, [256, False]]  # 14 (P3/8-small)
  - [-1, 1, MAFR, [256]]  # 15 - MAFR for enhanced feature representation
  
  # C3TR module after MAFR (as per paper section on C3TR following MAFR)
  - [-1, 1, C3TR_LWMP, [256, 1, 8]]  # 16 - C3TR with transformer
  
  # Detect with P2 and P3 for small object focus
  - [[11, 16], 1, Detect, [nc]]  # Detect(P2, P3 with MAFR+C3TR)