# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 with PP-LCNet backbone and MAFR modules

# Parameters
nc: 80  # number of classes

# YOLO11 backbone with PP-LCNet
backbone:
  # [from, repeats, module, args]
  - [-1, 1, lcnet_075, [3]]  # 0 - PP-LCNet backbone, outputs P3, P4, P5
  - [-1, 1, SPPF, [512, 5]]  # 1 - Applied to P5

# YOLO11 head with MAFR
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 2
  - [[-1, 0], 1, Concat, [1]]  # 3 - cat with P4 from backbone
  - [-1, 1, C2f, [256, False]]  # 4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 5
  - [[-1, 0], 1, Concat, [1]]  # 6 - cat with P3 from backbone
  - [-1, 1, C2f, [128, False]]  # 7 (P3/8-small)

  - [-1, 1, Conv, [128, 3, 2]]  # 8
  - [[-1, 4], 1, Concat, [1]]  # 9 - cat with layer 4
  - [-1, 1, C2f, [256, False]]  # 10 (P4/16-medium)

  - [-1, 1, Conv, [256, 3, 2]]  # 11
  - [[-1, 1], 1, Concat, [1]]  # 12 - cat with SPPF output
  - [-1, 1, C2f, [512, False]]  # 13 (P5/32-large)
  
  # Add MAFR modules before detection head
  - [7, 1, MAFR, [128]]   # 14 for P3
  - [10, 1, MAFR, [256]]  # 15 for P4
  - [13, 1, MAFR, [512]]  # 16 for P5

  - [[14, 15, 16], 1, Detect, [nc]]  # Detect(P3, P4, P5)