# Test configuration for PP-LCNet
# Parameters
nc: 80
scales:
  n: [0.33, 0.25, 1024]

# Simplified backbone test
backbone:
  - [-1, 1, Conv, [32, 3, 2]]         # 0
  - [-1, 1, Conv, [64, 3, 2]]         # 1
  - [-1, 1, Conv, [128, 3, 2]]        # 2
  - [-1, 1, Conv, [256, 3, 2]]        # 3
  - [-1, 1, Conv, [512, 3, 2]]        # 4
  - [-1, 1, SPPF, [512, 5]]           # 5

# Simple head
head:
  - [-1, 1, Conv, [256, 1, 1]]        # 6
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 7
  - [[-1, 3], 1, Concat, [1]]         # 8
  - [-1, 1, Conv, [256, 3, 1]]        # 9
  - [-1, 1, MAFR, [256]]              # 10
  - [[9, 10], 1, Detect, [nc]]        # 11