# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# LMWP-YOLO: LCbackbone (PP-LCNet via depthwise separable convs), MAFR neck, C3TRv2 head, AWLoss

# Parameters
nc: 80
activation: HardSwish
scales:
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# Backbone (PP-LCNet-like)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]                  # 0 stem P1/2
  - [-1, 1, DepSepConvHS, [128, 3, 2, 0]]      # 1 P2/4
  - [-1, 1, DepSepConvHS, [128, 3, 1, 0]]      # 2
  - [-1, 1, DepSepConvHS, [256, 3, 2, 0]]      # 3 P3/8
  - [-1, 1, DepSepConvHS, [256, 3, 1, 0]]      # 4
  - [-1, 1, DepSepConvHS, [512, 5, 2, 0]]      # 5 P4/16
  - [-1, 1, DepSepConvHS, [512, 5, 1, 0]]      # 6
  - [-1, 1, DepSepConvHS, [1024, 5, 2, 1]]     # 7 P5/32 (with SE)
  - [-1, 1, DepSepConvHS, [1024, 5, 1, 1]]     # 8 (with SE)
  - [-1, 1, SPPF, [1024, 5]]                   # 9
  - [-1, 2, C2PSA, [1024]]                     # 10

# Neck (Top-Down then Bottom-Up with MAFR and C3TRv2)
head:
  # Top-Down
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 11 up from P5->P4 scale
  - [[-1, 5], 1, Concat, [1]]                     # 12 concat with P4
  - [-1, 1, MAFR, [512]]                           # 13
  - [-1, 1, C3TRv2, [512]]                         # 14 mid map

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 15 up to P3 scale
  - [[-1, 3], 1, Concat, [1]]                     # 16 concat with P3
  - [-1, 1, MAFR, [256]]                           # 17
  - [-1, 1, C3TRv2, [256]]                         # 18 small map (P3)

  # Bottom-Up
  - [-1, 1, Conv, [256, 3, 2]]                     # 19 down to P4
  - [[-1, 14], 1, Concat, [1]]                     # 20 concat with mid map
  - [-1, 1, MAFR, [256]]                           # 21
  - [-1, 1, C3TRv2, [256]]                         # 22 medium map (P4)

  - [-1, 1, Conv, [512, 3, 2]]                     # 23 down to P5
  - [[-1, 10], 1, Concat, [1]]                     # 24 concat with top map
  - [-1, 1, MAFR, [512]]                           # 25
  - [-1, 1, C3TRv2, [512]]                         # 26 large map (P5)

  # Detect heads
  - [[18, 22, 26], 1, Detect, [nc]]                # Detect(P3, P4, P5)
