# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11-LWMP complete model with PP-LCNet architecture, MAFR, AWLoss and Pruning support

# Parameters
nc: 80  # number of classes

# PP-LCNet backbone architecture (x0.75)
backbone:
  # [from, repeats, module, args]
  # First conv
  - [-1, 1, Conv, [12, 3, 2]]  # 0-P1/2, 12 = make_divisible(16*0.75)
  
  # PP-LCNet blocks
  # k=3, c=32, s=1, SE=0
  - [-1, 1, Conv, [24, 3, 1]]  # 1, 24 = make_divisible(32*0.75)
  
  # k=3, c=64, s=2, SE=0  
  - [-1, 1, Conv, [48, 3, 2]]  # 2-P2/4, 48 = make_divisible(64*0.75)
  # k=3, c=64, s=1, SE=0
  - [-1, 1, Conv, [48, 3, 1]]  # 3
  
  # k=3, c=128, s=2, SE=0
  - [-1, 1, Conv, [96, 3, 2]]  # 4-P3/8, 96 = make_divisible(128*0.75)
  # k=3, c=128, s=1, SE=0
  - [-1, 1, Conv, [96, 3, 1]]  # 5
  
  # k=5, c=256, s=2, SE=0
  - [-1, 1, Conv, [192, 5, 2]]  # 6-P4/16, 192 = make_divisible(256*0.75)
  # k=5, c=256, s=1, SE=0 (x5)
  - [-1, 1, Conv, [192, 5, 1]]  # 7
  - [-1, 1, Conv, [192, 5, 1]]  # 8
  - [-1, 1, Conv, [192, 5, 1]]  # 9
  - [-1, 1, Conv, [192, 5, 1]]  # 10
  - [-1, 1, Conv, [192, 5, 1]]  # 11
  
  # k=5, c=512, s=2, SE=1
  - [-1, 1, Conv, [384, 5, 2]]  # 12-P5/32, 384 = make_divisible(512*0.75)
  # Apply SE module separately
  - [-1, 1, SELayer, [384, 16]]  # 13, reduction=16
  # k=5, c=512, s=1, SE=1
  - [-1, 1, Conv, [384, 5, 1]]  # 14
  - [-1, 1, SELayer, [384, 16]]  # 15
  
  # SPPF for P5
  - [-1, 1, SPPF, [384, 5]]  # 16

# YOLO11 head with MAFR
head:
  # P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 17
  - [[-1, 11], 1, Concat, [1]]  # 18 - cat with P4
  - [-1, 3, C2f, [192, False]]  # 19
  
  # P4 -> P3  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 20
  - [[-1, 5], 1, Concat, [1]]  # 21 - cat with P3
  - [-1, 3, C2f, [96, False]]  # 22 (P3/8-small)
  
  # P3 -> P4
  - [-1, 1, Conv, [96, 3, 2]]  # 23
  - [[-1, 19], 1, Concat, [1]]  # 24 - cat
  - [-1, 3, C2f, [192, False]]  # 25 (P4/16-medium)
  
  # P4 -> P5
  - [-1, 1, Conv, [192, 3, 2]]  # 26
  - [[-1, 16], 1, Concat, [1]]  # 27 - cat
  - [-1, 3, C2f, [384, False]]  # 28 (P5/32-large)
  
  # Add MAFR modules before detection head
  - [22, 1, MAFR, [96]]   # 29 for P3
  - [25, 1, MAFR, [192]]  # 30 for P4
  - [28, 1, MAFR, [384]]  # 31 for P5
  
  - [[29, 30, 31], 1, Detect, [nc]]  # Detect(P3, P4, P5)