# LWMP-YOLO with fixed indexing for lcnet_075 multi-outputs

# Parameters
nc: 80 # number of classes
scales:
  depth: 1.0
  width: 1.0

# Backbone - PP-LCNet x0.75
backbone:
  # [from, repeats, module, args]
  - [-1, 1, lcnet_075, [True]]           # 0 - PP-LCNet x0.75 (outputs P5/32)
  # The lcnet_075 module stores P2,P3,P4 as attributes but returns P5
  # We'll access them through the module instance in the head
  
  - [-1, 1, SPPF, [1024, 5]]             # 1 - SPPF on P5
  - [-1, 2, C2PSA, [1024]]               # 2 - C2PSA

# Head - Modified to properly reference features
head:
  # Build P4 detection branch
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # 3 - upsample from backbone
  - [-1, 1, Conv, [512, 1, 1]]                     # 4 - reduce channels
  - [-1, 2, C3k2, [512, False]]                    # 5 - P4/16 head
  
  # Build P3 detection branch  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # 6 - upsample P4
  - [-1, 1, Conv, [256, 1, 1]]                     # 7 - reduce channels
  - [-1, 2, C3k2, [256, False]]                    # 8 - P3/8 head
  
  # Build P2 detection branch
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # 9 - upsample P3
  - [-1, 1, Conv, [128, 1, 1]]                     # 10 - reduce channels
  - [-1, 2, C3k2, [128, False]]                    # 11 - P2/4 head
  
  # Build bottom-up path for P3
  - [-1, 1, Conv, [256, 3, 2]]                     # 12 - downsample P2
  - [[-1, 8], 1, Concat, [1]]                      # 13 - concat with P3
  - [-1, 2, C3k2, [256, False]]                    # 14 - fused P3
  
  # Build bottom-up path for P4  
  - [-1, 1, Conv, [512, 3, 2]]                     # 15 - downsample P3
  - [[-1, 5], 1, Concat, [1]]                      # 16 - concat with P4
  - [-1, 2, C3k2, [512, False]]                    # 17 - fused P4
  - [-1, 1, MAFR, [512]]                           # 18 - MAFR on P4
  
  # Detection head
  - [[11, 14, 18], 1, Detect, [nc]]               # 19 - Detect(P2, P3, P4)