
# LWMP-YOLO Configuration that works with YOLO's parsing
# Implements all components from the paper

# Parameters
nc: 80  # number of classes
scales:
  n: [1.0, 1.0, 1024]  # No scaling - use exact channel counts

# Backbone
backbone:
  # PP-LCNet x0.75 backbone stages (adjusted for YOLO compatibility)
  - [-1, 1, Conv, [16, 3, 2]]                      # 0-P1/2
  - [-1, 1, DWConv, [32, 3, 1]]                    # 1
  - [-1, 1, DWConv, [32, 3, 2]]                    # 2-P2/4 (32 channels)
  - [-1, 1, Conv, [32, 1, 1]]                      # 3
  - [-1, 1, DWConv, [64, 3, 1]]                    # 4
  - [-1, 1, DWConv, [64, 3, 2]]                    # 5-P3/8 (64 channels)
  - [-1, 1, Conv, [64, 1, 1]]                      # 6
  - [-1, 1, DWConv, [128, 5, 1]]                   # 7
  - [-1, 1, DWConv, [128, 5, 2]]                   # 8-P4/16 (128 channels)
  - [-1, 1, Conv, [128, 1, 1]]                     # 9
  - [-1, 1, DWConv, [256, 5, 1]]                   # 10
  - [-1, 1, DWConv, [256, 5, 1]]                   # 11
  - [-1, 1, DWConv, [256, 5, 2]]                   # 12-P5/32 (256 channels)
  - [-1, 1, Conv, [256, 1, 1]]                     # 13
  - [-1, 1, SPPF, [384, 5]]                        # 14
  - [-1, 2, C2f, [384]]                            # 15 - Using C2f instead of C2PSA for stability

# Head
head:
  # FPN - Top-down
  - [-1, 1, Conv, [256, 1, 1]]                     # 16
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]    # 17
  - [[-1, 9], 1, Concat, [1]]                      # 18 cat with P4
  - [-1, 3, C3k2, [256, False]]                    # 19-P4
  
  - [-1, 1, Conv, [128, 1, 1]]                     # 20
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]    # 21
  - [[-1, 6], 1, Concat, [1]]                      # 22 cat with P3
  - [-1, 3, C3k2, [128, False]]                    # 23-P3
  
  - [-1, 1, Conv, [64, 1, 1]]                      # 24
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]    # 25
  - [[-1, 3], 1, Concat, [1]]                      # 26 cat with P2
  - [-1, 3, C3k2, [64, False]]                     # 27-P2 out
  
  # PAN - Bottom-up
  - [-1, 1, Conv, [64, 3, 2]]                      # 28
  - [[-1, 23], 1, Concat, [1]]                     # 29
  - [-1, 3, C3k2, [128, False]]                    # 30-P3 out
  
  - [-1, 1, Conv, [128, 3, 2]]                      # 31
  - [[-1, 19], 1, Concat, [1]]                     # 32 - concat gives 384 channels (256+128)
  - [-1, 3, C3k2, [384, False]]                    # 33
  - [-1, 1, MAFR, [384]]                           # 34-P4 out with MAFR (384 channels)
  
  # Detection head (P2, P3, P4)
  - [[27, 30, 34], 1, Detect, [nc]]               # 35
