# Ultralytics YOLO 🚀, AGPL-3.0 license
# LWMP-YOLO with PP-LCNet x0.75 - Corrected Implementation
# Based on author's structure with fixed indices

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants
  n: [0.33, 0.25, 1024]

# YOLOv11 backbone with PP-LCNet x0.75
backbone:
  # PP-LCNet x0.75 outputs P5 (288ch) and stores P2,P3,P4 internally
  - [-1, 1, lcnet_075, [3, True]]      # 0 - outputs P5/32, 288ch
  - [-1, 1, Conv, [1024, 1, 1]]        # 1 - expand to 1024ch (as per author)
  - [-1, 1, SPPF, [1024, 5]]           # 2 - SPPF
  - [-1, 2, C2PSA, [1024]]             # 3 - C2PSA

# YOLOv11 head with P2 addition for small objects
head:
  # Create P4 path
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 4 - upsample from C2PSA
  - [-1, 1, Conv, [512, 1, 1]]                   # 5 - reduce channels
  - [-1, 2, C3k2, [512, False]]                  # 6 - P4/16 processing
  
  # Create P3 path
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 7 - upsample from P4
  - [-1, 1, Conv, [256, 1, 1]]                   # 8 - reduce channels
  - [-1, 2, C3k2, [256, False]]                  # 9 - P3/8 processing
  
  # Create P2 path (for small objects)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 10 - upsample from P3
  - [-1, 1, Conv, [128, 1, 1]]                   # 11 - reduce channels
  - [-1, 2, C3k2, [128, False]]                  # 12 - P2/4 processing
  
  # PAN - bottom up path
  - [-1, 1, Conv, [256, 3, 2]]                   # 13 - downsample P2 to P3
  - [[-1, 9], 1, Concat, [1]]                    # 14 - concat with P3
  - [-1, 2, C3k2, [256, False]]                  # 15 - P3 enhanced
  - [-1, 1, MAFR, [256]]                         # 16 - MAFR module on P3
  
  # Detection head (P2 and P3 as specified in paper)
  - [[12, 16], 1, Detect, [nc]]                  # 17 - Detect(P2, P3)