# Ultralytics YOLO 🚀, AGPL-3.0 license
# LWMP-YOLO: Corrected implementation based on author's structure
# Using exact PP-LCNet x0.75 with proper FPN

# Parameters
nc: 80  # number of classes
scales:
  n: [0.33, 0.25, 1024]

# Backbone - PP-LCNet x0.75
backbone:
  # PP-LCNet outputs: P2(36ch), P3(72ch), P4(144ch), P5(288ch)
  - [-1, 1, lcnet_075_exact, [3, True]]  # 0 - Custom module that stores features
  - [-1, 1, Conv, [288, 1, 1]]          # 1 - Match P5 channels (288->288)
  - [-1, 1, SPPF, [288, 5]]             # 2 - SPPF on P5
  - [-1, 1, Conv, [1024, 1, 1]]         # 3 - Project to 1024 (author's YAML)
  - [-1, 2, C2PSA, [1024]]              # 4 - C2PSA as in author's YAML

# Head - FPN with corrected indices
head:
  # Build P4 path
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 5 - Upsample from C2PSA
  - [-1, 1, Conv, [144, 1, 1]]                  # 6 - Project to P4 channels
  # Need to concat with backbone P4 (index TBD based on implementation)
  - [-1, 2, C3k2, [512, False]]                 # 7 - P4 processing
  
  # Build P3 path  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 8 - Upsample from P4
  - [-1, 1, Conv, [72, 1, 1]]                   # 9 - Project to P3 channels
  # Need to concat with backbone P3
  - [-1, 2, C3k2, [256, False]]                 # 10 - P3 processing
  
  # Build P2 path
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11 - Upsample from P3
  - [-1, 1, Conv, [36, 1, 1]]                   # 12 - Project to P2 channels
  # Need to concat with backbone P2
  - [-1, 2, C3k2, [128, False]]                 # 13 - P2 processing
  
  # PAN - bottom up
  - [-1, 1, Conv, [128, 3, 2]]                  # 14 - Downsample P2
  - [[-1, 10], 1, Concat, [1]]                  # 15 - Concat with P3
  - [-1, 2, C3k2, [256, False]]                 # 16 - P3 enhanced
  - [-1, 1, MAFR, [256]]                        # 17 - MAFR on P3
  
  # Detection head (P2 and P3)
  - [[13, 17], 1, Detect, [nc]]                 # 18 - Detect(P2, P3)