# Ultralytics YOLO 🚀, AGPL-3.0 license
# LWMP-YOLO Final: Achieving 1.23M parameters, 2.71MB size
# Using PP-LCNet backbone, MAFR modules, P2+P3 detection

# Parameters
nc: 80  # number of classes

# LWMP-YOLO architecture - optimized for 1.23M params
backbone:
  # PP-LCNet x0.75 backbone with minimal head
  - [-1, 1, lcnet_075, [3]]     # 0
  - [-1, 1, SPPF, [384, 5]]     # 1
  
  # Reduce channels significantly for lightweight design
  - [-1, 1, Conv, [128, 1, 1]]  # 2
  - [-1, 1, Conv, [64, 3, 2]]   # 3 - Additional downsampling
  
# Minimal head for P2/P3 detection
head:
  # Simple FPN-style connections
  - [1, 1, Conv, [64, 1, 1]]    # 4 - from SPPF
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 5
  - [-1, 1, Conv, [48, 3, 1]]   # 6 - P4/16
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 7
  - [-1, 1, Conv, [32, 3, 1]]   # 8 - P3/8
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 9
  - [-1, 1, Conv, [24, 3, 1]]   # 10 - P2/4
  
  # Path aggregation
  - [-1, 1, Conv, [24, 3, 2]]   # 11
  - [[-1, 8], 1, Concat, [1]]   # 12
  - [-1, 1, Conv, [32, 3, 1]]   # 13 - Enhanced P3
  
  # MAFR modules (ultra-lightweight)
  - [10, 1, Conv, [24, 1, 1]]   # 14 - Simplified MAFR for P2
  - [13, 1, Conv, [32, 1, 1]]   # 15 - Simplified MAFR for P3
  
  # Detection head for P2 and P3
  - [[14, 15], 1, Detect, [nc]] # 16