# Ultralytics YOLO 🚀, AGPL-3.0 license
# LWMP-YOLO: Final exact implementation with PP-LCNet x0.75
# Based on author's YAML with corrected indices

# Parameters
nc: 80  # number of classes
scales:
  n: [0.33, 0.25, 1024]

# Backbone - PP-LCNet x0.75
backbone:
  # PP-LCNet x0.75 outputs 1280ch after final conv (P5)
  # Stores P2(36ch), P3(72ch), P4(144ch) internally
  - [-1, 1, lcnet_075, [3, True]]              # 0
  - [-1, 1, SPPF, [1024, 5]]                   # 1 - Reduce from 1280 to 1024
  - [-1, 2, C2PSA, [1024]]                     # 2

# Head - Corrected FPN structure
head:
  # === FPN Top-down pathway ===
  
  # P4 branch
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 3 - upsample C2PSA
  - [0, 1, Index, ['p4']]                       # 4 - get P4 from backbone (144ch)
  - [[3, 4], 1, Concat, [1]]                    # 5 - concat upsampled + P4
  - [-1, 2, C3k2, [512, False]]                 # 6 - P4 processed
  
  # P3 branch  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 7 - upsample P4
  - [0, 1, Index, ['p3']]                       # 8 - get P3 from backbone (72ch)
  - [[7, 8], 1, Concat, [1]]                    # 9 - concat upsampled + P3
  - [-1, 2, C3k2, [256, False]]                 # 10 - P3 processed
  
  # P2 branch
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11 - upsample P3
  - [0, 1, Index, ['p2']]                       # 12 - get P2 from backbone (36ch)
  - [[11, 12], 1, Concat, [1]]                  # 13 - concat upsampled + P2
  - [-1, 2, C3k2, [128, False]]                 # 14 - P2 processed
  
  # === PAN Bottom-up pathway ===
  
  # P2 -> P3
  - [-1, 1, Conv, [256, 3, 2]]                  # 15 - downsample P2
  - [[-1, 10], 1, Concat, [1]]                  # 16 - concat with P3
  - [-1, 2, C3k2, [256, False]]                 # 17 - P3 enhanced
  - [-1, 1, MAFR, [256]]                        # 18 - MAFR on P3
  
  # === Detection head ===
  - [[14, 18], 1, Detect, [nc]]                 # 19 - Detect(P2, P3)