# Ultralytics YOLO 🚀, AGPL-3.0 license
# LWMP-YOLO: Following author's yolov11-lcnet-mafrneck.yaml exactly
# Key insight: Uses P2 and P3 for detection instead of P3, P4, P5

# Parameters
nc: 80  # number of classes

# YOLOv8.0n backbone
backbone:
  - [-1, 1, lcnet_075, [3]]     # 0 - PP-LCNet backbone
  - [-1, 1, SPPF, [1024, 5]]    # 1
  - [-1, 2, C2PSA, [1024]]      # 2

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 3
  - [[-1, 0], 1, Concat, [1]]   # 4 - cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 5

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 6
  - [[-1, 0], 1, Concat, [1]]   # 7 - cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 8 (P3/8-small)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 9
  - [[-1, 0], 1, Concat, [1]]   # 10 - cat backbone P2
  - [-1, 2, C3k2, [128, False]] # 11 (P2/4-xsmall)

  - [-1, 1, Conv, [256, 3, 2]]  # 12
  - [[-1, 8], 1, Concat, [1]]   # 13 - cat head P3
  - [-1, 2, C3k2, [256, False]] # 14 (P3/8-small)
  - [-1, 1, MAFR, [256]]        # 15

  - [[11, 15], 1, Detect, [nc]] # 16 - Detect(P2, P3)