# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11-LWMP model with LCbackbone, MAFR, AWLoss and Pruning

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv11n summary
  s: [0.33, 0.50, 1024]  # YOLOv11s summary
  m: [0.67, 0.75, 768]   # YOLOv11m summary
  l: [1.00, 1.00, 512]   # YOLOv11l summary
  x: [1.00, 1.25, 512]   # YOLOv11x summary

# YOLOv11 backbone with LCBackbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [16, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [32, 3, 2]]  # 1-P2/4  
  - [-1, 1, C3k2, [32, True]]  # 2
  - [-1, 1, Conv, [64, 3, 2]]  # 3-P3/8
  - [-1, 1, C3k2, [64, True]]  # 4
  - [-1, 1, Conv, [128, 3, 2]] # 5-P4/16
  - [-1, 1, C3k2, [128, True]] # 6
  - [-1, 1, Conv, [256, 3, 2]] # 7-P5/32
  - [-1, 1, C3k2, [256, True]] # 8
  - [-1, 1, SPPF, [256, 5]]    # 9
  - [-1, 1, C2PSA, [256]]      # 10

# YOLOv11 head with MAFR
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 2, C3k2, [128, False]]  # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 2, C3k2, [64, False]]  # 16 (P3/8-small)

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]  # cat head P4
  - [-1, 2, C3k2, [256, False]]  # 19 (P4/16-medium)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]  # cat head P5
  - [-1, 2, C3k2, [256, False]]  # 22 (P5/32-large)
  
  # Add MAFR module before detection head
  - [16, 1, MAFR, [64]]   # 23 for P3
  - [19, 1, MAFR, [256]]  # 24 for P4
  - [22, 1, MAFR, [256]]  # 25 for P5

  - [[23, 24, 25], 1, Detect, [nc]]  # Detect(P3, P4, P5)