# Ultralytics YOLO 🚀, AGPL-3.0 license
# LWMP-YOLO Minimal - Testing basic functionality

# Parameters
nc: 80  # number of classes

# Backbone - PP-LCNet x0.75
backbone:
  - [-1, 1, lcnet_075, [True]]      # 0 - outputs 384ch @ P5/32
  - [-1, 1, SPPF, [384, 5]]         # 1

# Head - Simplified
head:
  # Create P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 2
  - [-1, 1, Conv, [192, 1, 1]]      # 3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 4
  - [-1, 1, Conv, [96, 1, 1]]       # 5 - P3/8
  
  # Create P2
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 6
  - [-1, 1, Conv, [48, 1, 1]]       # 7 - P2/4
  
  # Simple detection on P2 and P3
  - [[7, 5], 1, Detect, [nc]]       # 8 - Detect(P2, P3)