# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 with PP-LCNet (x0.75) backbone and MAFR modules
# Implementing PP-LCNet with depthwise separable convolutions

# Parameters
nc: 80  # number of classes

# PP-LCNet backbone architecture (x0.75)
backbone:
  # [from, repeats, module, args]
  # First conv - make_divisible(16*0.75) = 12
  - [-1, 1, Conv, [12, 3, 2]]  # 0-P1/2
  - [-1, 1, nn.BatchNorm2d, [12]]  # 1
  - [-1, 1, nn.ReLU6, [True]]  # 2 - using ReLU6 as approximation of HardSwish
  
  # Block 0: k=3, c=32*0.75=24, s=1, SE=0
  - [-1, 1, DWConv, [24, 3, 1]]  # 3 - Depthwise Separable Conv
  
  # Block 1: k=3, c=64*0.75=48, s=2, SE=0  
  - [-1, 1, DWConv, [48, 3, 2]]  # 4-P2/4
  
  # Block 2: k=3, c=64*0.75=48, s=1, SE=0
  - [-1, 1, DWConv, [48, 3, 1]]  # 5
  
  # Block 3: k=3, c=128*0.75=96, s=2, SE=0
  - [-1, 1, DWConv, [96, 3, 2]]  # 6-P3/8
  
  # Block 4: k=3, c=128*0.75=96, s=1, SE=0
  - [-1, 1, DWConv, [96, 3, 1]]  # 7
  
  # Block 5: k=5, c=256*0.75=192, s=2, SE=0
  - [-1, 1, DWConv, [192, 5, 2]]  # 8-P4/16
  
  # Blocks 6-10: k=5, c=256*0.75=192, s=1, SE=0 (repeat 5 times)
  - [-1, 1, DWConv, [192, 5, 1]]  # 9
  - [-1, 1, DWConv, [192, 5, 1]]  # 10
  - [-1, 1, DWConv, [192, 5, 1]]  # 11
  - [-1, 1, DWConv, [192, 5, 1]]  # 12
  - [-1, 1, DWConv, [192, 5, 1]]  # 13
  
  # Block 11: k=5, c=512*0.75=384, s=2, SE=1
  - [-1, 1, DWConv, [384, 5, 2]]  # 14-P5/32
  - [-1, 1, SELayer, [384, 16]]  # 15 - SE module with reduction=16
  
  # Block 12: k=5, c=512*0.75=384, s=1, SE=1
  - [-1, 1, DWConv, [384, 5, 1]]  # 16
  - [-1, 1, SELayer, [384, 16]]  # 17 - SE module
  
  # SPPF for P5
  - [-1, 1, SPPF, [384, 5]]  # 18

# YOLO11 head with MAFR
head:
  # P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 19
  - [[-1, 13], 1, Concat, [1]]  # 20 - cat with P4 features
  - [-1, 3, C2f, [192, False]]  # 21
  
  # P4 -> P3  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 22
  - [[-1, 7], 1, Concat, [1]]  # 23 - cat with P3 features
  - [-1, 3, C2f, [96, False]]  # 24 (P3/8-small)
  
  # P3 -> P4
  - [-1, 1, Conv, [96, 3, 2]]  # 25
  - [[-1, 21], 1, Concat, [1]]  # 26
  - [-1, 3, C2f, [192, False]]  # 27 (P4/16-medium)
  
  # P4 -> P5
  - [-1, 1, Conv, [192, 3, 2]]  # 28
  - [[-1, 18], 1, Concat, [1]]  # 29
  - [-1, 3, C2f, [384, False]]  # 30 (P5/32-large)
  
  # Add MAFR modules before detection head
  - [24, 1, MAFR, [96]]   # 31 for P3
  - [27, 1, MAFR, [192]]  # 32 for P4
  - [30, 1, MAFR, [384]]  # 33 for P5
  
  - [[31, 32, 33], 1, Detect, [nc]]  # Detect(P3, P4, P5)